Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresSettings.GetOptions Method
Overload List
Name | Description
GetOptions(ClashCheckOptions)
 Returns the value of the clash check options.
GetOptions(ComponentOptions)
 Returns the value of the component options.
Top
See Also
Reference
TeklaStructuresSettings Class
Tekla.Structures Namespace